---
kind: type
id: T:Autodesk.Revit.DB.BoundarySegment
source: html/9a8fc43c-7a89-b6b4-e8ad-3e1e331ac153.htm
---
# Autodesk.Revit.DB.BoundarySegment

An object that represents a segment of an area boundary.

## Syntax (C#)
```csharp
public class BoundarySegment : IDisposable
```

## Remarks
These objects define the exterior boundary of an area. The geometry of the
 segment can be retrieved along with the id of the element that is responsible for producing that boundary.